[
  {
    "name": "MinecraftLauncher-core",
    "image": "MinecraftLauncher-core.webp",
    "description": "A Node.js solution for launching modded and vanilla Minecraft without having to download and format everything yourself. Basically a launcher core for Electron or script based launchers",
    "url": "https://github.com/Pierce01/MinecraftLauncher-core"
  },
  {
    "name": "Personal Website",
    "image": "React.webp",
    "description": "My personal website that is built with React and TypeScript while being hosted on GitHub Pages. It is a simple website that showcases my projects and provides a way to contact me",
    "url": "https://github.com/Pierce01/website"
  },
  {
    "name": "AI Virtual Assistant",
    "image": "Votegrity.webp",
    "description": "My team's capstone project that helps voters recover their lost ballot pin, as well as answer FAQs using Azure's Conversational Language Understanding Model. Frontend: TypeScript/React, Backend: C#, Middleware/Server Stack: Django and PostgreSQL. Code can be provided upon request",
    "url": "https://github.com/Votegrity-Capstone"
  },
  {
    "name": "ResponSight ML",
    "image": "INRIX.webp",
    "description": "Provided automotive collision forcasting to help EMS minimize response time, by leveraging machine learning. Our team trained our model on historic data and use INRIX APIs to make real-time predictions",
    "url": "https://github.com/MarcAldrichBrophy/responsightml"
  },
  {
    "name": "t4.ts",
    "image": "t4.ts.webp",
    "description": "A TypeScript library for working with the TerminalFour Content Manager API. Powers all of the scripts and tools that I have written for the Seattle University CMS",
    "url": "https://pierce01.github.io/t4.ts/"
  },
  {
    "name": "MapBan - Rainbow6",
    "image": "Discord.svg",
    "description": "A simple Node.js Discord bot for competitive Rainbow6 Siege that was written for CCS Esports. This bot briged the gap between the production team and the players by allowing them to ban maps and select sides",
    "url": "https://github.com/Pierce01/MapBan-R6"
  },
  {
    "name": "WildBeast",
    "image": "WildBeast.webp",
    "description": "Wildbeast is a multifunctional Discord bot written in TypeScript, intended to provide a framework that's easy to use, extend, and modify. Primary controbutions include the XKCD commic command and the ability get Twitch stream information and updates",
    "url": "https://github.com/TheSharks"
  }
]